# pandas的拼接操作

pandas的拼接分为两种：
- 级联：pd.concat, pd.append
- 合并：pd.merge, pd.join

In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

为方便讲解，我们首先定义一个生成DataFrame的函数：
```
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)
make_df('ABC', range(3))
```

In [5]:
def make_df(cols,index):
    '''
    快速生成一个DataFrame
    '''
    data = {c:[str(c)+str(i) for i in index] for c in cols}
    return DataFrame(data,ind)

In [21]:
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

## 0. 回顾numpy的级联

In [7]:
x = np.array([1,2,3]).reshape(1,3)
y = np.array([4,5,6]).reshape(1,3)
z = np.array([7,8,9]).reshape(1,3)
display(x,y,z)
np.concatenate([x,y,z])

array([[1, 2, 3]])

array([[4, 5, 6]])

array([[7, 8, 9]])

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

============================================

练习12：

1. 生成2个3*3的矩阵，对其分别进行两个维度上的级联

============================================

In [10]:
x = np.random.randn(3,3)
x

array([[-0.09120671, -0.52299759, -0.16349379],
       [ 0.36666059, -1.3587184 ,  0.81883706],
       [ 1.0621649 ,  0.72906367, -0.41325065]])

In [14]:
np.concatenate([x,x])

array([[-0.09120671, -0.52299759, -0.16349379],
       [ 0.36666059, -1.3587184 ,  0.81883706],
       [ 1.0621649 ,  0.72906367, -0.41325065],
       [-0.09120671, -0.52299759, -0.16349379],
       [ 0.36666059, -1.3587184 ,  0.81883706],
       [ 1.0621649 ,  0.72906367, -0.41325065]])

In [12]:
np.concatenate([x,x],axis=1)

array([[-0.09120671, -0.52299759, -0.16349379, -0.09120671, -0.52299759,
        -0.16349379],
       [ 0.36666059, -1.3587184 ,  0.81883706,  0.36666059, -1.3587184 ,
         0.81883706],
       [ 1.0621649 ,  0.72906367, -0.41325065,  1.0621649 ,  0.72906367,
        -0.41325065]])

## 1. 使用pd.concat()级联

pandas使用pd.concat函数，与np.concatenate函数类似，只是多了一些参数：
```
pd.concat(objs, axis=0, join='outer', join_axes=None, ignore_index=False,
          keys=None, levels=None, names=None, verify_integrity=False,
          copy=True)
```

### 1)  简单级联

In [3]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
s1 = Series(['A','B','C'],index = [1,2,3])
s2 = Series(['D','E','F'],index = [4,5,6])
pd.concat([s1,s2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

和np.concatenate一样，优先增加行数（默认axis=0）

In [36]:
df1 = make_df('BP',[1,2])
df2 = make_df('GZ',[2,8])
display(df1,df2,pd.concat([df1,df2]))

    B   P
1  B1  P1
2  B2  P2

    G   Z
2  G2  Z2
8  G8  Z8

     B    G    P    Z
1   B1  NaN   P1  NaN
2   B2  NaN   P2  NaN
2  NaN   G2  NaN   Z2
8  NaN   G8  NaN   Z8

In [37]:
df1 = make_df('AB',[1,2])
df2 = make_df('AB',[3,4])
display(df1,df2,pd.concat([df1,df2]))

    A   B
1  A1  B1
2  A2  B2

    A   B
3  A3  B3
4  A4  B4

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

可以通过设置axis来改变级联方向

In [8]:
df3 = make_df('AB',[0,1])
df4 = make_df('CD',[0,1])
display(df3,df4,pd.concat([df3,df4],axis=1))

    A   B
0  A0  B0
1  A1  B1

    C   D
0  C0  D0
1  C1  D1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

注意index在级联时可以重复

In [35]:
x = make_df('AB',[0,1])
y = make_df('AB',[1,8])
pd.concat([x,y])

    A   B
0  A0  B0
1  A1  B1
1  A1  B1
8  A8  B8

也可以选择忽略index，重新索引

In [17]:
pd.concat([x,y],ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A4  B4
3  A8  B8

In [28]:
pd.concat?

或者使用多层索引keys

In [27]:
display(pd.concat([x,y]))
display(pd.concat([x,y],keys=['x','y']))
display(x,y)
display(pd.concat([x,y],axis = 1))
display(pd.concat([x,y],axis = 1,keys = ['v','r']))

    A   B
0  A0  B0
1  A1  B1
1  A1  B1
8  A8  B8

      A   B
x 0  A0  B0
  1  A1  B1
y 1  A1  B1
  8  A8  B8

    A   B
0  A0  B0
1  A1  B1

    A   B
1  A1  B1
8  A8  B8

     A    B    A    B
0   A0   B0  NaN  NaN
1   A1   B1   A1   B1
8  NaN  NaN   A8   B8

     v         r
     A    B    A    B
0   A0   B0  NaN  NaN
1   A1   B1   A1   B1
8  NaN  NaN   A8   B8

============================================

练习13：

1. 想一想级联的应用场景？

2. 使用昨天的知识，建立一个期中考试张三、李四的成绩表ddd

3. 假设新增考试学科"计算机"，如何实现？

4. 新增王老五同学的成绩，如何实现？

============================================

In [54]:
np.random.seed(10)
a = np.random.randint(150,size=(4,2))
ddd = DataFrame(a,columns = ["张三","李四"],index = ["语文","数学","英语","理综"])
ddd

     张三   李四
语文    9  125
数学   15   64
英语  113  123
理综  113    8

In [56]:
ddd2 = DataFrame([[50,50]],columns = ["张三","李四"],index = ["Python"])
ddd2

        张三  李四
Python  50  50

In [57]:
ddd = pd.concat([ddd,ddd2])

In [34]:
ddd

         张三  李四
语文       52  45
数学       37  56
英语      102  42
理综       29  94
Python   50  50

### 2) 不匹配级联

不匹配指的是级联的维度的索引不一致。例如纵向级联时列索引不一致，横向级联时行索引不一致

有3种连接方式：

- 外连接：补NaN（默认模式）

In [38]:
x = make_df('ABC',[1,2])
y = make_df('BCD',[3,4])
display(x,y,pd.concat([x,y]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

    B   C   D
3  B3  C3  D3
4  B4  C4  D4

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

- 内连接：只连接匹配的项

In [38]:
display(x,y,pd.concat([x,y],join="inner"))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

    B   C   D
3  B3  C3  D3
4  B4  C4  D4

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

- 连接指定轴

In [41]:
display(x,y,pd.concat([x,y],join_axes=[x.columns]))

    A   B   C
1  A1  B1  C1
2  A2  B2  C2

    B   C   D
3  B3  C3  D3
4  B4  C4  D4

     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

============================================

练习14：

    假设【期末】考试ddd2的成绩没有张三的，只有李四、王老五、赵小六的，使用多种方法级联

============================================

In [59]:
ddd

         张三   李四
语文        9  125
数学       15   64
英语      113  123
理综      113    8
Python   50   50

In [87]:
np.random.seed(15)
a = np.random.randint(150,size=(5,3))
ddd2 = DataFrame(a,columns=["王五","李四","赵小六"],
                index = ["语文","数学","英语","理综","Python"])
np.random.seed(10)
ddd = DataFrame(np.random.randint(150,size = (5,3)),
                                  columns = ['张三','李四','小莲'],
                                  index = ["语文","数学","英语","理综","Python"])
display(ddd2)
display(ddd)

         王五   李四  赵小六
语文      140  133  119
数学      128   85  118
英语       17   23   62
理综       10  143  105
Python   39   37   19

         张三   李四   小莲
语文        9  125   15
数学       64  113  123
英语      113    8   73
理综        0   40  115
Python   16  100  139

In [88]:
df = pd.concat([ddd,ddd2],axis = 1,ignore_index=False)
df

         张三   李四   小莲   王五   李四  赵小六
语文        9  125   15  140  133  119
数学       64  113  123  128   85  118
英语      113    8   73   17   23   62
理综        0   40  115   10  143  105
Python   16  100  139   39   37   19

In [85]:
pd.concat([ddd,ddd2],keys=["期中","期末"],axis = 0)

              小莲     张三   李四     王五    赵小六
期中 语文       15.0    9.0  125    NaN    NaN
   数学      123.0   64.0  113    NaN    NaN
   英语       73.0  113.0    8    NaN    NaN
   理综      115.0    0.0   40    NaN    NaN
   Python  139.0   16.0  100    NaN    NaN
期末 语文        NaN    NaN  125    9.0   15.0
   数学        NaN    NaN  113   64.0  123.0
   英语        NaN    NaN    8  113.0   73.0
   理综        NaN    NaN   40    0.0  115.0
   Python    NaN    NaN  100   16.0  139.0

### 3) 使用append()函数添加

由于在后面级联的使用非常普遍，因此有一个函数append专门用于在后面添加

In [91]:
x = make_df('AB',[0,1])
y = make_df('AB',[3,8])
display(x,y,pd.concat([x,y]))

    A   B
0  A0  B0
1  A1  B1

    A   B
3  A3  B3
8  A8  B8

    A   B
0  A0  B0
1  A1  B1
3  A3  B3
8  A8  B8

In [93]:
x = make_df('AB',np.random.randint(10,size = 2))
y = make_df('AB',np.random.randint(10,20,size = 2))
display(x.append(y))

      A    B
6    A6   B6
8    A8   B8
11  A11  B11
18  A18  B18

============================================

练习15：

    新建一个只有张三李四王老五的期末考试成绩单ddd3，使用append()与期中考试成绩表ddd级联

============================================

## 2. 使用pd.merge()合并

merge与concat的区别在于，merge需要依据某一共同的行或列来进行合并

使用pd.merge()合并时，会自动根据两者相同column名称的那一列，作为key来进行合并。

注意每一列元素的顺序不要求一致

###  1) 一对一合并

In [13]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
df1 = DataFrame({'employee':['Lisa','Bob','Jake'],
                'group':['Accounting','Engineering','Engineering'],
                })
df2 = DataFrame({'employee':['Lisa','Bob','Jake'],
                'hire_date':[2004,2008,2012],
                })
display(df1,df2)

  employee        group
0     Lisa   Accounting
1      Bob  Engineering
2     Jake  Engineering

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012

In [14]:
df3 = pd.merge(df1,df2)
df3

  employee        group  hire_date
0     Lisa   Accounting       2004
1      Bob  Engineering       2008
2     Jake  Engineering       2012

### 2) 多对一合并

In [17]:
df3 = DataFrame({
    'employee':['Lisa','Bob','Jake'],
    'group':['Accounting','Engineering','Engineering'],
    'hire_date':[2004,2009,2016]})
df4 = DataFrame({'group':['Accounting','Engineering','Engineering'],
                       'supervisor':['Carly','Guido','Steve']
                })
display(df3,df4,pd.merge(df3,df4))#多对一合并

  employee        group  hire_date
0     Lisa   Accounting       2004
1      Bob  Engineering       2009
2     Jake  Engineering       2016

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2  Engineering      Steve

  employee        group  hire_date supervisor
0     Lisa   Accounting       2004      Carly
1      Bob  Engineering       2009      Guido
2      Bob  Engineering       2009      Steve
3     Jake  Engineering       2016      Guido
4     Jake  Engineering       2016      Steve

### 3) 多对多合并

In [21]:
df1 = DataFrame({'employee':['Bob','Jake','Lisa'],
                 'group':['Accounting','Engineering','Engineering']})
df5 = DataFrame({'group':['Engineering','Engineering','HR'],
                'supervisor':['Carly','Guido','Steve']
                })
display(df1,df5,pd.merge(df1,df5))#多对多
display(pd.concat([df1,df5]))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering

         group supervisor
0  Engineering      Carly
1  Engineering      Guido
2           HR      Steve

  employee        group supervisor
0     Jake  Engineering      Carly
1     Jake  Engineering      Guido
2     Lisa  Engineering      Carly
3     Lisa  Engineering      Guido

  employee        group supervisor
0      Bob   Accounting        NaN
1     Jake  Engineering        NaN
2     Lisa  Engineering        NaN
0      NaN  Engineering      Carly
1      NaN  Engineering      Guido
2      NaN           HR      Steve

### 4) key的规范化

- 使用on=显式指定哪一列为key

In [41]:
df1 = DataFrame({'employee':['Jack',"Summer","Steve"],
                 'group':['Accounting','Finance','Marketing']})

df2 = DataFrame({'employee':['Jack','Bob',"Jake"],
                 'hire_date':[2003,2009,2012],
                'group':['Accounting','sell','ceo']})
display(df1,df2,pd.merge(df1,df2),pd.merge(df1,df2,on = 'employee'))

  employee       group
0     Jack  Accounting
1   Summer     Finance
2    Steve   Marketing

  employee       group  hire_date
0     Jack  Accounting       2003
1      Bob        sell       2009
2     Jake         ceo       2012

  employee       group  hire_date
0     Jack  Accounting       2003

  employee     group_x     group_y  hire_date
0     Jack  Accounting  Accounting       2003

- 使用left_on和right_on指定左右两边的列作为key

In [56]:
df5 = DataFrame({'name':['Lisa','Bob','Jake'],
                'hire_date':[2004,2008,2012],
                })

In [57]:
display(df1,df5,pd.merge(df1,df5,left_on='employee',right_on='name'))

  employee       group  hire_date
0      Bob  Accounting       1998
1    Linda     Product       2017
2     Bill   Marketing       2018

   hire_date  name
0       2004  Lisa
1       2008   Bob
2       2012  Jake

  employee       group  hire_date_x  hire_date_y name
0      Bob  Accounting         1998         2008  Bob

In [60]:
df1 = DataFrame({'employee':['Bob','Linda','Bill'],
                'group':['Accounting','Product','Marketing'],
               'hire_date':[1998,2017,2018]})
df5 = DataFrame({'name':['Lisa','Bob','Bill'],
                'hire_date':[1998,2016,2007]})

display(df1,df5,pd.concat([df1,df5]),pd.merge(df1,df5,left_on = 'employee',right_on = 'name'))

  employee       group  hire_date
0      Bob  Accounting       1998
1    Linda     Product       2017
2     Bill   Marketing       2018

   hire_date  name
0       1998  Lisa
1       2016   Bob
2       2007  Bill

  employee       group  hire_date  name
0      Bob  Accounting       1998   NaN
1    Linda     Product       2017   NaN
2     Bill   Marketing       2018   NaN
0      NaN         NaN       1998  Lisa
1      NaN         NaN       2016   Bob
2      NaN         NaN       2007  Bill

  employee       group  hire_date_x  hire_date_y  name
0      Bob  Accounting         1998         2016   Bob
1     Bill   Marketing         2018         2007  Bill

============================================

练习16：

1. 假设有两份成绩单，除了ddd是张三李四王老五之外，还有ddd4是张三和赵小六的成绩单，如何合并？

2. 如果ddd4中张三的名字被打错了，成为了张十三，怎么办？

3. 自行练习多对一，多对多的情况

============================================

In [64]:
a1 = np.array([[122,107],[21,14],[110,38],[128,111],[50,50]])
ddd1 = DataFrame(a1,columns=["张三","李四"],
                index = ["语文","数学","英语","理综","计算机"])
ddd1

      张三   李四
语文   122  107
数学    21   14
英语   110   38
理综   128  111
计算机   50   50

In [90]:
a2 = [[122,120],[21,25],[110,95],[128,61],[50,45]]
ddd2 = DataFrame(np.random.randint(100,size = (5,3)),columns=["李四","赵小六",'张五'],
                index = ["语文","数学","英语","理综","计算机"])
ddd2

     李四  赵小六  张五
语文   40   77  50
数学   79   45  50
英语   15   24  54
理综   47   26  55
计算机  13   36  32

In [92]:
pd.merge(ddd1,ddd2,left_index = True,right_index = True,on = ['李四'])

      张三   李四  赵小六  张五
语文   122  107   77  50
数学    21   14   45  50
英语   110   38   24  54
理综   128  111   26  55
计算机   50   50   36  32

In [94]:
a1 = np.array([[122,107],[21,14],[110,38],[128,111],[50,50]])
ddd1 = DataFrame(a1,columns=["张三","李四"],
                index = ["语文","数学","英语","理综","计算机"])

a2 = [[122,120],[21,25],[110,95],[128,61],[50,45]]
ddd2 = DataFrame(np.random.randint(100,size = (5,3)),columns=["李四","赵小六",'张五'],
                index = ["语文","数学","英语","理综","计算机"])
display(ddd1,ddd2)
pd.merge(ddd1,ddd2,left_index = True,right_index = True,on = ['李四'])

      张三   李四
语文   122  107
数学    21   14
英语   110   38
理综   128  111
计算机   50   50

     李四  赵小六  张五
语文   95   76  85
数学   89   15   4
英语   28   79  21
理综   99   58  28
计算机  21    5  58

      张三   李四  赵小六  张五
语文   122  107   76  85
数学    21   14   15   4
英语   110   38   79  21
理综   128  111   58  28
计算机   50   50    5  58

In [95]:
a2 = [[122,120],[21,25],[110,95],[128,61],[50,45]]
ddd3 = DataFrame(a2,columns=["张十三","赵小六"],
                index = ["语文","数学","英语","理综","计算机"])
ddd3

     张十三  赵小六
语文   122  120
数学    21   25
英语   110   95
理综   128   61
计算机   50   45

In [96]:
ddd4 = pd.merge(ddd1,ddd3,left_on='张三',right_on='张十三')
ddd4

    张三   李四  张十三  赵小六
0  122  107  122  120
1   21   14   21   25
2  110   38  110   95
3  128  111  128   61
4   50   50   50   45

In [97]:
del ddd4['张十三']

In [98]:
ddd4

    张三   李四  赵小六
0  122  107  120
1   21   14   25
2  110   38   95
3  128  111   61
4   50   50   45

### 5) 内合并与外合并

- 内合并：只保留两者都有的key（默认模式）

In [99]:
df6 = DataFrame({'name':['Peter','Paul','Mary'],
               'food':['fish','beans','bread']}
               )
df7 = DataFrame({'name':['Mary','Joseph'],
                'drink':['wine','beer']})
display(df6,df7,pd.merge(df6,df7))

    food   name
0   fish  Peter
1  beans   Paul
2  bread   Mary

  drink    name
0  wine    Mary
1  beer  Joseph

    food  name drink
0  bread  Mary  wine

- 外合并 how='outer'：补NaN

In [102]:
df6 = DataFrame({'name':['Peter','Paul','Mary'],
               'food':['fish','beans','bread']}
               )
df7 = DataFrame({'name':['Mary','Joseph'],
                'drink':['wine','beer']})
display(df6,df7,pd.merge(df6,df7,how='outer'))

    food   name
0   fish  Peter
1  beans   Paul
2  bread   Mary

  drink    name
0  wine    Mary
1  beer  Joseph

    food    name drink
0   fish   Peter   NaN
1  beans    Paul   NaN
2  bread    Mary  wine
3    NaN  Joseph  beer

- 左合并、右合并：how='left'，how='right'，

In [104]:
df6 = DataFrame({'name':['Peter','Paul','Mary'],
               'food':['fish','beans','bread']}
               )
df7 = DataFrame({'name':['Mary','Joseph'],
                'drink':['wine','beer']})
display(df6,df7,pd.merge(df6,df7,how='left'))

    food   name
0   fish  Peter
1  beans   Paul
2  bread   Mary

  drink    name
0  wine    Mary
1  beer  Joseph

    food   name drink
0   fish  Peter   NaN
1  beans   Paul   NaN
2  bread   Mary  wine

In [90]:
display(df6,df7,pd.merge(df6,df7,how='right'))

    food   name
0   fish  Peter
1  beans   Paul
2  bread   Mary

  drink    name
0  wine    Mary
1  beer  Joseph

    food    name drink
0  bread    Mary  wine
1    NaN  Joseph  beer

============================================

练习17：

1. 如果只有张三赵小六语数英三个科目的成绩，如何合并？

3. 考虑应用情景，使用多种方式合并ddd与ddd4

============================================

In [3]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
np.random.seed(10)
ddd = DataFrame(np.random.randint(150,size = (5,2)),
                index = ['语文','数学','英语','理综','编程'],columns = ['张三','李四'])
ddd

     张三   李四
语文    9  125
数学   15   64
英语  113  123
理综  113    8
编程   73    0

In [4]:
ddd4 = DataFrame({'张三':[122,21,110],
                 '赵小六':[78,96,83]},
                 index = ['语文','数学','英语']
                )
ddd4

     张三  赵小六
语文  122   78
数学   21   96
英语  110   83

In [56]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
np.random.seed(10)
df1 = DataFrame({'张三':[127,119,99,119,73],'李四':[125,64,123,99,139]},
                index = ['语文','数学','英语','理综','编程'],columns = ['张三','李四'])

df2 = DataFrame({'张三':[122,21,110],
                 '赵小六':[78,96,83]},
                 index = ['语文','数学','英语']
                )
display(df1,df2)
pd.merge(df1,df2,how = 'left',on = '张三',left_index = True,right_index = True)

     张三   李四
语文  127  125
数学  119   64
英语   99  123
理综  119   99
编程   73  139

     张三  赵小六
语文  122   78
数学   21   96
英语  110   83

     张三   李四   赵小六
语文  127  125  78.0
数学  119   64  96.0
英语   99  123  83.0
理综  119   99   NaN
编程   73  139   NaN

In [101]:
display(pd.merge(ddd,ddd4,how='left'))

    张三   李四   赵小六
0  122  107  78.0
1   21   14  96.0
2  110   38  83.0
3  128  111   NaN
4   50   50   NaN

In [23]:
pd.merge?

### 6) 列冲突的解决

当列冲突时，即有多个列名称相同时，需要使用on=来指定哪一个列作为key

In [57]:
df8 = DataFrame({'name':['Peter','Paul','Mary'],
               'rank':[1,2,3]}
               )
df9 = DataFrame({'name':['Peter','Paul','Mary'],
                'rank':[5,6,7]})
display(df8,df9)

    name  rank
0  Peter     1
1   Paul     2
2   Mary     3

    name  rank
0  Peter     5
1   Paul     6
2   Mary     7

In [66]:
df8 = DataFrame({'name':['Peter','Paul','Mary'],
                'rank':[1,2,3]})
df9 = DataFrame({'name':['Peter','Paul','Mary'],
                'rank':[5,6,7]})
display(df8,df8,pd.merge(df8,df9,on = 'name',suffixes=['rank_L','rank_R']))

    name  rank
0  Peter     1
1   Paul     2
2   Mary     3

    name  rank
0  Peter     1
1   Paul     2
2   Mary     3

    name  rankrank_L  rankrank_R
0  Peter           1           5
1   Paul           2           6
2   Mary           3           7

可以使用suffixes=自己指定后缀

In [58]:
display(pd.merge(df8,df9,on='name',suffixes=["_L",'_R']))

    name  rank_L  rank_R
0  Peter       1       5
1   Paul       2       6
2   Mary       3       7

============================================

练习18：

    假设有两个同学都叫李四，ddd5、ddd6都是张三和李四的成绩表，如何合并？

============================================

In [67]:
ddd

     张三   李四
语文    9  125
数学   15   64
英语  113  123
理综  113    8
编程   73    0

In [88]:
np.random.seed(100)
df4 = DataFrame(np.random.randint(150,size = (5,2)),
               columns = ['张三','李四'],
               index = ['语文','数学','英语','理综','计算机'])
df5 = DataFrame({'张三':[8,67,87,128,50],
                 '李四':[24,103,83,45,58]},
                 index = ['语文','数学','英语','理综','计算机']
                )
display(df4,df5)
pd.merge(df4,df5,on = '张三',left_index = True,right_index = True)

      张三   李四
语文     8   24
数学    67  103
英语    87   79
理综   138   94
计算机   98   53

      张三   李四
语文     8   24
数学    67  103
英语    87   83
理综   128   45
计算机   50   58

      张三  李四_x  李四_y
语文     8    24    24
数学    67   103   103
英语    87    79    83
理综   138    94    45
计算机   98    53    58

In [110]:
pd.merge(ddd,ddd5,on='张三')

    张三  李四_x  李四_y
0  122   107    78
1   21    14    96
2  110    38    83
3  128   111    45
4   50    50    58

## 3. 案例分析：美国各州人口数据分析

首先导入文件，并查看数据样本

In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
pop = pd.read_csv('../../data/state-population.csv')
areas = pd.read_csv('../../data/state-areas.csv')
abbrevs = pd.read_csv('../../data/state-abbrevs.csv')
display(pop.head(),areas.head(),abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

合并pop与abbrevs两个DataFrame，分别依据state/region列和abbreviation列来合并。

为了保留所有信息，使用外合并。

In [3]:
merged = pd.merge(pop,abbrevs,how='outer',left_on = 'state/region',right_on = 'abbreviation')
merged2 = pd.merge(pop,abbrevs,left_on = 'state/region',right_on = 'abbreviation')
display(merged.head(),merged2.head())

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

去除abbreviation的那一列（axis=1）

In [4]:
merged = merged.drop('abbreviation',axis = 1)
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

查看存在缺失数据的列。

使用.isnull().any()，只有某一列存在一个缺失数据，就会显示True。

In [30]:
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

查看缺失数据的例子

In [5]:
# display(merged['population'].isnull()) # 查看列population 缺失数据 如果缺失返回null
merged[merged['population'].isnull()] #根据数据是否缺失情况显示数据，如果缺失为True，那么显示

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN
2453           PR  under18  1993         NaN   NaN
2454           PR  under18  1992         NaN   NaN
2455           PR    total  1992         NaN   NaN
2456           PR  under18  1994         NaN   NaN
2457           PR    total  1994         NaN   NaN
2458           PR    total  1995         NaN   NaN
2459           PR  under18  1995         NaN   NaN
2460           PR  under18  1996         NaN   NaN
2461           PR    total  1996         NaN   NaN
2462           PR  under18  1998         NaN   NaN
2463           PR    total  1998         NaN   NaN
2464           PR    total  1997         NaN   NaN
2465           PR  under18  1997         NaN   NaN
2466           PR    total  1999         NaN   NaN
2467           PR  under18  1999         NaN   NaN

找到有哪些state/region使得state的值为NaN，使用unique()去重

In [6]:
# merged.loc[merged['state'].isnull(),'state/region'].unique()
# merged[merged['state'].isnull(),'state/region']# 出问题
# merged[merged['state'].isnull()]
s = merged.loc[merged['state'].isnull(),'state/region']
ss = s.unique()
display(s,ss)

2448     PR
2449     PR
2450     PR
2451     PR
2452     PR
2453     PR
2454     PR
2455     PR
2456     PR
2457     PR
2458     PR
2459     PR
2460     PR
2461     PR
2462     PR
2463     PR
2464     PR
2465     PR
2466     PR
2467     PR
2468     PR
2469     PR
2470     PR
2471     PR
2472     PR
2473     PR
2474     PR
2475     PR
2476     PR
2477     PR
       ...
2514    USA
2515    USA
2516    USA
2517    USA
2518    USA
2519    USA
2520    USA
2521    USA
2522    USA
2523    USA
2524    USA
2525    USA
2526    USA
2527    USA
2528    USA
2529    USA
2530    USA
2531    USA
2532    USA
2533    USA
2534    USA
2535    USA
2536    USA
2537    USA
2538    USA
2539    USA
2540    USA
2541    USA
2542    USA
2543    USA
Name: state/region, Length: 96, dtype: object

array(['PR', 'USA'], dtype=object)

为找到的这些state/region的state项补上正确的值，从而去除掉state这一列的所有NaN！

记住这样清除缺失数据NaN的方法！

In [7]:
merged.loc[merged['state/region']=='PR','state'] = 'Puerto Rico'
merged.loc[merged['state/region']=='USA','state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

合并各州面积数据areas，使用左合并。

思考一下为什么使用左合并？

In [8]:
display(merged.shape,areas.shape)
df1 = pd.merge(merged,areas,on = 'state')
df2 = pd.merge(merged,areas,on = 'state',how = 'left')
display(df1.shape,df2.shape)

(2544, 5)

(52, 2)

(2496, 6)

(2544, 6)

In [125]:
merged.shape

(2544, 5)

继续寻找存在缺失数据的列

In [101]:
df2.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

我们会发现area(sq.mi)这一列有缺失数据，为了找出是哪一行，我们需要找出是哪个state没有数据

In [111]:
s1 = df2['state'][df2['area (sq. mi)'].isnull()]
display(s1.shape)

(48,)

去除含有缺失数据的行

In [9]:
# df2.dropna(inplace=True)
display(df2.shape,df2.dropna(inplace = True),df2.shape)

(2544, 6)

None

(2476, 6)

查看数据是否缺失

In [121]:
df2.isnull().any()

state/region     False
ages             False
year             False
population       False
state            False
area (sq. mi)    False
dtype: bool

找出2010年的全民人口数据

In [10]:
display(df2.shape,type(df2))
# data2010 = df2.query("year == 2010 & ages == 'total'")
data2010 = df2.query("year == 2010 & ages == 'total'")
display(data2010.shape)
data2010.head()

(2476, 6)

pandas.core.frame.DataFrame

(52, 6)

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

对查询结果进行处理，以state列作为新的行索引

In [11]:
# data2010.set_index('state',inplace=True)
data2010.set_index('state',inplace = True)
display(data2010.shape)
data2010.head()

(52, 5)

           state/region   ages  year  population  area (sq. mi)
state
Alabama              AL  total  2010   4785570.0        52423.0
Alaska               AK  total  2010    713868.0       656425.0
Arizona              AZ  total  2010   6408790.0       114006.0
Arkansas             AR  total  2010   2922280.0        53182.0
California           CA  total  2010  37333601.0       163707.0

计算人口密度。注意是Series/Series，其结果还是一个Series。

In [20]:
density = data2010['population'].div(data2010['area (sq. mi)']) #出发运算
display(data2010.shape,type(data2010),type(df2),density.head(),type(density))

(52, 5)

pandas.core.frame.DataFrame

pandas.core.frame.DataFrame

state
Alabama        91.287603
Alaska          1.087509
Arizona        56.214497
Arkansas       54.948667
California    228.051342
dtype: float64

pandas.core.series.Series

排序，并找出人口密度最高的五个州

In [27]:
display(density.sort_values(ascending=False,inplace = False).head())
# density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

找出人口密度最低的五个州

In [30]:
display(density.sort_values(ascending=False).tail())

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

要点总结：
- 统一用loc()索引
- 善于使用.isnull().any()找到存在NaN的列
- 善于使用.unique()确定该列中哪些key是我们需要的
- 一般使用外合并、左合并，目的只有一个：宁愿该列是NaN也不要丢弃其他列的信息

## 回顾：Series/DataFrame运算与ndarray运算的区别

- Series与DataFrame没有广播，如果对应index没有值，则记为NaN；或者使用add的fill_value来补缺失值
- ndarray有广播，通过重复已有值来计算

In [138]:
a = np.array([1,2,3])
b = np.array([2])
display(a,b,a+b)

array([1, 2, 3])

array([2])

array([3, 4, 5])

In [32]:
s = Series([1,2,3])
s2 = Series([2])
display(s,s+1,s+s2)
display(s.add(s2,fill_value=0))

0    1
1    2
2    3
dtype: int64

0    2
1    3
2    4
dtype: int64

0    3.0
1    NaN
2    NaN
dtype: float64

0    3.0
1    2.0
2    3.0
dtype: float64

In [140]:
s+1

0    2
1    3
2    4
dtype: int64

In [141]:
s2 = Series([2])
s2

0    2
dtype: int64

In [144]:
s.add(s2)

0    3.0
1    NaN
2    NaN
dtype: float64

In [146]:
s.add(s2,fill_value=0)

0    3.0
1    2.0
2    3.0
dtype: float64

In [40]:
df = DataFrame({'A':[1,2,3],
               'B':[4,5,6]})
df2 = DataFrame(np.random.randint(10,size = (3,2)),columns=['B','c'])
display(df,df2,df+df2,df.add(df2,fill_value = 0).astype(int))

   A  B
0  1  4
1  2  5
2  3  6

   B  c
0  3  5
1  5  3
2  9  7

    A   B   c
0 NaN   7 NaN
1 NaN  10 NaN
2 NaN  15 NaN

     A   B    c
0  1.0   7  5.0
1  2.0  10  3.0
2  3.0  15  7.0

In [148]:
df2 = DataFrame({'B':[1,2,3],
                'C':[4,5,6]})
df2

   B  C
0  1  4
1  2  5
2  3  6

In [149]:
df.add(df2)

    A  B   C
0 NaN  5 NaN
1 NaN  7 NaN
2 NaN  9 NaN

In [150]:
df.add(df2,fill_value=0)

     A  B    C
0  1.0  5  4.0
1  2.0  7  5.0
2  3.0  9  6.0